In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration': duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [7]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [11]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. 
This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. 
This method includes the last element of the range passed in it, unlike iloc(). 
loc() can accept the boolean data unlike iloc()

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [24]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.132759  0.915922  0.253411  0.455565  0.493187  0.715907
2  0.827728  0.006718  0.131063  0.432478  0.155969  0.310643
3  0.588238  0.615323  0.456519  0.355225  0.160746  0.071875
4  0.188085  0.672089  0.752180  0.194524  0.623173  0.566842
5  0.609439  0.180016  0.410176  0.146160  0.834981  0.479554
6  0.363687  0.709103  0.865060  0.916750  0.623932  0.250113

In [26]:
ndf=df1.reindex([3,0,1,2])

In [27]:
ndf

   column_1  column_2  column_3  column_4  column_5  column_6
3  0.588238  0.615323  0.456519  0.355225  0.160746  0.071875
0       NaN       NaN       NaN       NaN       NaN       NaN
1  0.132759  0.915922  0.253411  0.455565  0.493187  0.715907
2  0.827728  0.006718  0.131063  0.432478  0.155969  0.310643

In [28]:
ndf.loc[2]
#accesses the column having index =2

column_1    0.827728
column_2    0.006718
column_3    0.131063
column_4    0.432478
column_5    0.155969
column_6    0.310643
Name: 2, dtype: float64

In [29]:
ndf.iloc[2]
#accesses the second index elements

column_1    0.132759
column_2    0.915922
column_3    0.253411
column_4    0.455565
column_5    0.493187
column_6    0.715907
Name: 1, dtype: float64

In [ ]:
Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [30]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.132759  0.915922  0.253411  0.455565  0.493187  0.715907
2  0.827728  0.006718  0.131063  0.432478  0.155969  0.310643
3  0.588238  0.615323  0.456519  0.355225  0.160746  0.071875
4  0.188085  0.672089  0.752180  0.194524  0.623173  0.566842
5  0.609439  0.180016  0.410176  0.146160  0.834981  0.479554
6  0.363687  0.709103  0.865060  0.916750  0.623932  0.250113

In [31]:
df1.mean()

column_1    0.451656
column_2    0.516529
column_3    0.478068
column_4    0.416784
column_5    0.481998
column_6    0.399156
dtype: float64

In [32]:
df1.std()

column_1    0.269772
column_2    0.347479
column_3    0.283146
column_4    0.275006
column_5    0.273604
column_6    0.233270
dtype: float64

In [33]:
df1.describe()

       column_1  column_2  column_3  column_4  column_5  column_6
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.451656  0.516529  0.478068  0.416784  0.481998  0.399156
std    0.269772  0.347479  0.283146  0.275006  0.273604  0.233270
min    0.132759  0.006718  0.131063  0.146160  0.155969  0.071875
25%    0.231986  0.288843  0.292602  0.234699  0.243856  0.265245
50%    0.475962  0.643706  0.433348  0.393852  0.558180  0.395098
75%    0.604139  0.699849  0.678265  0.449793  0.623742  0.545020
max    0.827728  0.915922  0.865060  0.916750  0.834981  0.715907

In [ ]:
Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.

In [49]:
df1.loc[2]['column_2']

0.006718461790642061

In [50]:
df1=df1.replace(df1.loc[2]['column_2'],'Aamir')

In [51]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.132759  0.915922  0.253411  0.455565  0.493187  0.715907
2  0.827728     Aamir  0.131063  0.432478  0.155969  0.310643
3  0.588238  0.615323  0.456519  0.355225  0.160746  0.071875
4  0.188085  0.672089  0.752180  0.194524  0.623173  0.566842
5  0.609439  0.180016  0.410176  0.146160  0.834981  0.479554
6  0.363687  0.709103  0.865060  0.916750  0.623932  0.250113

In [52]:
df1.mean()

/tmp/ipykernel_77/2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

column_1    0.451656
column_3    0.478068
column_4    0.416784
column_5    0.481998
column_6    0.399156
dtype: float64

In [53]:
#Since one of the value in column_2 is string, its not showing any mean for that column

In [ ]:
Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

In [ ]:
Window functions allow us to perform computations among the values of a specified column. 
For example, I might want to compare today’s stock price with yesterday’s — then I would want a window of “1” looking backwards.

In [ ]:
.rolling() Function

    This function can be applied on a series of data. Specify the window=n argument and apply the appropriate statistical function on top of it.

.expanding() Function

    This function can be applied on a series of data. Specify the min_periods=n argument and apply the appropriate statistical function on top of it.

.ewm() Function

    ewm is applied on a series of data. Specify any of the com, span, halflife argument and apply the appropriate statistical function on top of it. 
It assigns the weights exponentially.

In [ ]:
Q7. Write a code to print only the current month and year at the time of answering this question.

In [7]:
from datetime import date
todays_date = date.today()
current_month=todays_date.month
current_year=todays_date.year
print(current_month)
print(current_year)

7
2023

In [ ]:
Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [19]:
import pandas as pd
daet1=input("Enter first date")
daet2=input("Enter second date")
daet1=pd.to_datetime(daet1)
daet2=pd.to_datetime(daet2)
diff= daet2-daet1
days=diff.days
hours=diff.seconds//3600
minutes=(diff.seconds//60)%60
print(days,hours,minutes)

Enter first date 2023-11-12 00:00:00
Enter second date 2023-12-12 12:59:59

30 12 59

In [ ]:
Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.

In [20]:
import pandas as pd
df=pd.read_csv('player.csv')

In [21]:
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [30]:
df['ORB']

0       79
1        9
2      199
3       23
4       27
      ...
670    127
671     75
672     52
673     97
674    146
Name: ORB, Length: 675, dtype: object

In [1]:
import pandas as pd

# Get the file path from the user
file_path = input("Enter the file path: ")

# Read the CSV file
data = pd.read_csv(file_path)

# Get the column name from the user
column_name = input("Enter the column name: ")

# Get the category order from the user
category_order = input("Enter the category order (comma-separated): ").split(',')

# Convert the column to categorical data type with the specified category order
data[column_name] = pd.Categorical(data[column_name], categories=category_order, ordered=True)

# Sort the data based on the specified column
sorted_data = data.sort_values(by=column_name)

# Display the sorted data
print(sorted_data)

Enter the file path:  player.csv
Enter the column name:  Age
Enter the category order (comma-separated):  m,f

      Rk          Player Pos  Age   Tm   G  GS    MP   FG  FGA  ...   FT%  \
0      1      Quincy Acy  PF  NaN  NYK  68  22  1287  152  331  ...  .784
1      2    Jordan Adams  SG  NaN  MEM  30   0   248   35   86  ...  .609
2      3    Steven Adams   C  NaN  OKC  70  67  1771  217  399  ...  .502
3      4     Jeff Adrien  PF  NaN  MIN  17   0   215   19   44  ...  .579
4      5   Arron Afflalo  SG  NaN  TOT  78  72  2502  375  884  ...  .843
..   ...             ...  ..  ...  ...  ..  ..   ...  ...  ...  ...   ...
670  490  Thaddeus Young  PF  NaN  TOT  76  68  2434  451  968  ...  .655
671  490  Thaddeus Young  PF  NaN  MIN  48  48  1605  289  641  ...  .682
672  490  Thaddeus Young  PF  NaN  BRK  28  20   829  162  327  ...  .606
673  491     Cody Zeller   C  NaN  CHO  62  45  1487  172  373  ...  .774
674  492    Tyler Zeller   C  NaN  BOS  82  59  1731  340  619  ...  .823

     ORB  DRB  TRB  AST  STL BLK  TOV   PF   PTS
0     79  222  301   68   27  22   60  147   398
1      9   19   28   16   16   7   14   24    94
2    199  324  523   66   38  86   99  222   537
3     23   54   77   15    4   9    9   30    60
4     27  220  247  129   41   7  116  167  1035
..   ...  ...  ...  ...  ...  ..  ...  ...   ...
670  127  284  411  173  124  25  117  171  1071
671   75  170  245  135   86  17   75  115   685
672   52  114  166   38   38   8   42   56   386
673   97  265  362  100   34  49   62  156   472
674  146  319  465  113   18  52   76  205   833

[675 rows x 30 columns]

Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

file_path=input("Enter the file name")

data=pd.read_csv(file_path)

grouped_data = data.groupby('Category')['Sales'].sum().unstack()

grouped_data.plot(kind='bar', stacked=True)

plt.xlabel('Year')
plt.ylabel('Sales')
plt.title('Sales of each product category over time')

plt.show()

You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.

In [10]:
import pandas as pd
file_path=input("Enter the file name")
data=pd.read_csv(file_path)

means=data['Test Score'].mean()
medians=data['Test Score'].median()
modes=mode(data['Test Score'])

result=pd.DataFrame({'Measure':['Mean','Median','Mode'],'Score':[means,medians,modes]})
print(result)

Enter the file name stud.csv

  Measure  Score
0    Mean   83.5
1  Median   85.0
2    Mode   85.0

In [4]:
data=pd.read_csv("stud.csv")
data

   Student ID  Test Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [9]:

import pandas as pd
from statistics import mode

# Prompt user to enter file path
file_path = input("Enter the file path: ")

# Read CSV file into a DataFrame
data = pd.read_csv(file_path)

# Calculate mean, median, and mode of test scores
mean_score = data['Test Score'].mean()
median_score = data['Test Score'].median()
mode_score = mode(data['Test Score'])

# Create a DataFrame to display the results
results = pd.DataFrame({
    'Measure': ['Mean', 'Median', 'Mode'],
    'Score': [mean_score, median_score, mode_score]
})

# Display the results
print(results)

Enter the file path:  stud.csv

  Measure  Score
0    Mean   83.5
1  Median   85.0
2    Mode   85.0